OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16f1615.c
__at(0x0597) __sfr PID1OUTLH;
__at(0x0597) volatile __PID1OUTLHbits_t PID1OUTLHbits;

__at(0x0598) __sfr PID1OUTHL;
__at(0x0598) volatile __PID1OUTHLbits_t PID1OUTHLbits;

__at(0x0599) __sfr PID1OUTHH;
__at(0x0599) volatile __PID1OUTHHbits_t PID1OUTHHbits;

__at(0x059A) __sfr PID1OUTU;
__at(0x059A) volatile __PID1OUTUbits_t PID1OUTUbits;

__at(0x059B) __sfr PID1Z1;

__at(0x059B) __sfr PID1Z1L;
__at(0x059B) volatile __PID1Z1Lbits_t PID1Z1Lbits;

__at(0x059C) __sfr PID1Z1H;
__at(0x059C) volatile __PID1Z1Hbits_t PID1Z1Hbits;

__at(0x059D) __sfr PID1Z1U;
__at(0x059D) volatile __PID1Z1Ubits_t PID1Z1Ubits;

__at(0x060C) __sfr PID1Z2;

__at(0x060C) __sfr PID1Z2L;
__at(0x060C) volatile __PID1Z2Lbits_t PID1Z2Lbits;

__at(0x060D) __sfr PID1Z2H;
__at(0x060D) volatile __PID1Z2Hbits_t PID1Z2Hbits;

__at(0x060E) __sfr PID1Z2U;
__at(0x060E) volatile __PID1Z2Ubits_t PID1Z2Ubits;

__at(0x060F) __sfr PID1ACC;

__at(0x060F) __sfr PID1ACCLL;
__at(0x060F) volatile __PID1ACCLLbits_t PID1ACCLLbits;

__at(0x0610) __sfr PID1ACCLH;
__at(0x0610) volatile __PID1ACCLHbits_t PID1ACCLHbits;

__at(0x0611) __sfr PID1ACCHL;
__at(0x0611) volatile __PID1ACCHLbits_t PID1ACCHLbits;

__at(0x0612) __sfr PID1ACCHH;
__at(0x0612) volatile __PID1ACCHHbits_t PID1ACCHHbits;

__at(0x0613) __sfr PID1ACCU;
__at(0x0613) volatile __PID1ACCUbits_t PID1ACCUbits;

__at(0x0614) __sfr PID1CON;
__at(0x0614) volatile __PID1CONbits_t PID1CONbits;

__at(0x0617) __sfr PWM3DCL;
__at(0x0617) volatile __PWM3DCLbits_t PWM3DCLbits;

__at(0x0618) __sfr PWM3DCH;
__at(0x0618) volatile __PWM3DCHbits_t PWM3DCHbits;

__at(0x0619) __sfr PWM3CON;
__at(0x0619) volatile __PWM3CONbits_t PWM3CONbits;

__at(0x061A) __sfr PWM4DCL;
__at(0x061A) volatile __PWM4DCLbits_t PWM4DCLbits;

__at(0x061B) __sfr PWM4DCH;
__at(0x061B) volatile __PWM4DCHbits_t PWM4DCHbits;

__at(0x061C) __sfr PWM4CON;
__at(0x061C) volatile __PWM4CONbits_t PWM4CONbits;

__at(0x0691) __sfr CWG1DBR;
__at(0x0691) volatile __CWG1DBRbits_t CWG1DBRbits;

__at(0x0692) __sfr CWG1DBF;
__at(0x0692) volatile __CWG1DBFbits_t CWG1DBFbits;

__at(0x0693) __sfr CWG1AS0;
__at(0x0693) volatile __CWG1AS0bits_t CWG1AS0bits;

__at(0x0694) __sfr CWG1AS1;
__at(0x0694) volatile __CWG1AS1bits_t CWG1AS1bits;

__at(0x0695) __sfr CWG1OCON0;
__at(0x0695) volatile __CWG1OCON0bits_t CWG1OCON0bits;

__at(0x0696) __sfr CWG1CON0;
__at(0x0696) volatile __CWG1CON0bits_t CWG1CON0bits;

__at(0x0697) __sfr CWG1CON1;
__at(0x0697) volatile __CWG1CON1bits_t CWG1CON1bits;

__at(0x0699) __sfr CWG1CLKCON;
__at(0x0699) volatile __CWG1CLKCONbits_t CWG1CLKCONbits;

__at(0x069A) __sfr CWG1ISM;
__at(0x069A) volatile __CWG1ISMbits_t CWG1ISMbits;

__at(0x0711) __sfr WDTCON0;
__at(0x0711) volatile __WDTCON0bits_t WDTCON0bits;

__at(0x0712) __sfr WDTCON1;
__at(0x0712) volatile __WDTCON1bits_t WDTCON1bits;

__at(0x0713) __sfr WDTPSL;
__at(0x0713) volatile __WDTPSLbits_t WDTPSLbits;

__at(0x0714) __sfr WDTPSH;
__at(0x0714) volatile __WDTPSHbits_t WDTPSHbits;

__at(0x0715) __sfr WDTTMR;
__at(0x0715) volatile __WDTTMRbits_t WDTTMRbits;

__at(0x0718) __sfr SCANLADR;

__at(0x0718) __sfr SCANLADRL;
__at(0x0718) volatile __SCANLADRLbits_t SCANLADRLbits;

__at(0x0719) __sfr SCANLADRH;
__at(0x0719) volatile __SCANLADRHbits_t SCANLADRHbits;

__at(0x071A) __sfr SCANHADR;

__at(0x071A) __sfr SCANHADRL;
__at(0x071A) volatile __SCANHADRLbits_t SCANHADRLbits;

__at(0x071B) __sfr SCANHADRH;
__at(0x071B) volatile __SCANHADRHbits_t SCANHADRHbits;

__at(0x071C) __sfr SCANCON0;
__at(0x071C) volatile __SCANCON0bits_t SCANCON0bits;

__at(0x071D) __sfr SCANTRIG;
__at(0x071D) volatile __SCANTRIGbits_t SCANTRIGbits;

__at(0x0791) __sfr CRCDAT;

__at(0x0791) __sfr CRCDATL;
__at(0x0791) volatile __CRCDATLbits_t CRCDATLbits;

__at(0x0792) __sfr CRCDATH;
__at(0x0792) volatile __CRCDATHbits_t CRCDATHbits;

__at(0x0793) __sfr CRCACC;

__at(0x0793) __sfr CRCACCL;
__at(0x0793) volatile __CRCACCLbits_t CRCACCLbits;

__at(0x0794) __sfr CRCACCH;
__at(0x0794) volatile __CRCACCHbits_t CRCACCHbits;

__at(0x0795) __sfr CRCSHIFT;

__at(0x0795) __sfr CRCSHIFTL;
__at(0x0795) volatile __CRCSHIFTLbits_t CRCSHIFTLbits;

__at(0x0796) __sfr CRCSHIFTH;
__at(0x0796) volatile __CRCSHIFTHbits_t CRCSHIFTHbits;

__at(0x0797) __sfr CRCXOR;

__at(0x0797) __sfr CRCXORL;
__at(0x0797) volatile __CRCXORLbits_t CRCXORLbits;

__at(0x0798) __sfr CRCXORH;
__at(0x0798) volatile __CRCXORHbits_t CRCXORHbits;

__at(0x0799) __sfr CRCCON0;
__at(0x0799) volatile __CRCCON0bits_t CRCCON0bits;

__at(0x079A) __sfr CRCCON1;
__at(0x079A) volatile __CRCCON1bits_t CRCCON1bits;

__at(0x080C) __sfr AT1RES;

__at(0x080C) __sfr AT1RESL;
__at(0x080C) volatile __AT1RESLbits_t AT1RESLbits;

__at(0x080D) __sfr AT1RESH;
__at(0x080D) volatile __AT1RESHbits_t AT1RESHbits;

__at(0x080E) __sfr AT1MISS;

__at(0x080E) __sfr AT1MISSL;
__at(0x080E) volatile __AT1MISSLbits_t AT1MISSLbits;

__at(0x080F) __sfr AT1MISSH;
__at(0x080F) volatile __AT1MISSHbits_t AT1MISSHbits;

__at(0x0810) __sfr AT1PER;

__at(0x0810) __sfr AT1PERL;
__at(0x0810) volatile __AT1PERLbits_t AT1PERLbits;

__at(0x0811) __sfr AT1PERH;
__at(0x0811) volatile __AT1PERHbits_t AT1PERHbits;

__at(0x0812) __sfr AT1PHS;

__at(0x0812) __sfr AT1PHSL;
__at(0x0812) volatile __AT1PHSLbits_t AT1PHSLbits;

__at(0x0813) __sfr AT1PHSH;
__at(0x0813) volatile __AT1PHSHbits_t AT1PHSHbits;

__at(0x0814) __sfr AT1CON0;
__at(0x0814) volatile __AT1CON0bits_t AT1CON0bits;

__at(0x0815) __sfr AT1CON1;
__at(0x0815) volatile __AT1CON1bits_t AT1CON1bits;

__at(0x0816) __sfr AT1IR0;
__at(0x0816) volatile __AT1IR0bits_t AT1IR0bits;

__at(0x0817) __sfr AT1IE0;
__at(0x0817) volatile __AT1IE0bits_t AT1IE0bits;

__at(0x0818) __sfr AT1IR1;
__at(0x0818) volatile __AT1IR1bits_t AT1IR1bits;

__at(0x0819) __sfr AT1IE1;
__at(0x0819) volatile __AT1IE1bits_t AT1IE1bits;

__at(0x081A) __sfr AT1STPT;

__at(0x081A) __sfr AT1STPTL;
__at(0x081A) volatile __AT1STPTLbits_t AT1STPTLbits;

__at(0x081B) __sfr AT1STPTH;
__at(0x081B) volatile __AT1STPTHbits_t AT1STPTHbits;

__at(0x081C) __sfr AT1ERR;

__at(0x081C) __sfr AT1ERRL;
__at(0x081C) volatile __AT1ERRLbits_t AT1ERRLbits;

__at(0x081D) __sfr AT1ERRH;
__at(0x081D) volatile __AT1ERRHbits_t AT1ERRHbits;

__at(0x088C) __sfr AT1CLK;
__at(0x088C) volatile __AT1CLKbits_t AT1CLKbits;

